# Создайте несколько переменных разных типов.
# Проверьте к какому типу относятся созданные переменные. 

a = 4
b = 2/3
c = "текст"
d = 5.0
e = [1,2.3,3,4]

print(a, type(a))
print(b, type(b))
print(c, type(c))
print(d, type(d))
print(e, type(e))