import sem6.chess as ch


if __name__ == '__main__':
    queen = [[1,1], [2,3], [3,5], [4,7], [5,2], [6,8], [7,6], [8,4]]
    # queen = [[1,6], [2,1], [3,5], [4,2], [5,8], [6,3], [7,7], [8,4]] # безопасное положение
    # queen = [[1,1], [2,3], [3,6], [4,7], [5,2], [6,8], [7,6], [8,4]]
    res = ch.chess(queen)
    if res:
        print(f"Положение ферзей с такими координатами: \n{queen} \nбезопасно для них.\n")
    else: 
        print(f"Положение ферзей с такими координатами: \n{queen} \nопасно для них. Ферзи побьют друг друга.\n")